Revit 2027 API
CommandEventArgs.CommandId Property
 The command id.
Namespace: Autodesk.Revit.UI.Events
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public RevitCommandId CommandId { get; }
Public ReadOnly Property CommandId As RevitCommandId
	Get
public:
property RevitCommandId^ CommandId {
	RevitCommandId^ get ();
}
member CommandId : RevitCommandId with get
Property Value
RevitCommandId
See Also
Reference
CommandEventArgs Class
Autodesk.Revit.UI.Events Namespace